In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('lung_cancer_examples.csv')
df.head()

     Name      Surname  Age  Smokes  AreaQ  Alkhol  Result
0    John         Wick   35       3      5       4       1
1    John  Constantine   27      20      2       5       1
2  Camela     Anderson   30       0      5       2       0
3    Alex       Telles   28       0      8       1       0
4   Diego     Maradona   68       4      5       6       1

In [3]:
df = df.drop(['Name', 'Surname'], axis=1)
df.head()

   Age  Smokes  AreaQ  Alkhol  Result
0   35       3      5       4       1
1   27      20      2       5       1
2   30       0      5       2       0
3   28       0      8       1       0
4   68       4      5       6       1

In [4]:
df.shape

(59, 5)

In [5]:
df.isnull().sum()

Age       0
Smokes    0
AreaQ     0
Alkhol    0
Result    0
dtype: int64

In [6]:
X = df.drop(['Result'], axis=1)
X.head()

   Age  Smokes  AreaQ  Alkhol
0   35       3      5       4
1   27      20      2       5
2   30       0      5       2
3   28       0      8       1
4   68       4      5       6

In [7]:
y = df['Result']
y.head()

0    1
1    1
2    0
3    0
4    1
Name: Result, dtype: int64

In [8]:
# Train, test & split
from sklearn.model_selection import train_test_split

In [9]:
X_train, X_test, y_train, y_test = train_test_split(X, y,test_size=.20, random_state=0)

In [10]:
X_test

    Age  Smokes  AreaQ  Alkhol
26   37      15      6       2
35   25      20      8       2
43   63      20      4       5
28   55      20      1       4
11   18      10      6       3
2    30       0      5       2
34   26      10      7       2
46   31      20      9       4
40   50      20      2       4
22   22      20      6       2
4    68       4      5       6
10   33       4      8       0

In [11]:
y_test

26    0
35    0
43    1
28    1
11    0
2     0
34    0
46    0
40    1
22    0
4     1
10    0
Name: Result, dtype: int64

In [12]:
from sklearn.linear_model import LogisticRegression

In [13]:
lr = LogisticRegression()

In [14]:
lr.fit(X_train, y_train)

LogisticRegression()

In [15]:
lr.predict(X_test)

array([0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0], dtype=int64)

In [16]:
lr.score(X_test, y_test)

1.0

In [17]:
predict = lr.predict([[51, 14, 3, 5]])

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LogisticRegression was fitted with feature names
  warnings.warn(

In [18]:
predict

array([1], dtype=int64)